'''
Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
'''

from random import randint
print("введите длинну массива")
n = int(input())
print("введите нужное число")
a = int(input())
count = 0
nums = []
nums(randint(1, 10))
for i in range (n):
    nums[randint(1, 10)]
    if [i] == a:
        count += 1
print(nums)
print (a, "встречается", count)





    

