#  Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
#  Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
#  Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов 
#  (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из
#  одного слова, если во фразе несколько слов, то они разделяются дефисами.
#  Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает
#  в программу с клавиатуры. В ответе напишите “Парам пам-пам”, 
#  если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
#  *Пример:*
#  **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#      **Вывод:** Парам пам-пам  

string = input()
def says(str):
    str = str.split() #преобразуем в список
    list = []
    for word in str:
        counter = 0
        for i in word:
            if i in "аоеуиыэяё":
                counter+=1
    return len(list) == list.count(list[0])
if says(string):
    print("парам пам пам")
else:
    print("пам пам")
